---
kind: type
id: T:Autodesk.Revit.DB.KeynoteEntry
source: html/a4537bdf-25eb-0542-ab28-affcaf5632c2.htm
---
# Autodesk.Revit.DB.KeynoteEntry

Represents an entry in the keynote table, containing the key value, keynote text, and parent key (if applicable).

## Syntax (C#)
```csharp
public class KeynoteEntry : KeyBasedTreeEntry
```